nn_cats_ii/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = current_user.rental_requests.new(cat_rental_request_params)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 11], ["end_date", "2017-07-25"], ["start_date", "2017-07-11"], ["status", "PENDING"], ["created_at", "2017-07-27 20:49:56.058902"], ["updated_at", "2017-07-27 20:49:56.058902"]]